{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"data_format": "channels_last", "activation": "relu", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "batch_input_shape": [null, 224, 224, 3], "name": "conv2d_1", "strides": [1, 1], "padding": "valid", "filters": 64, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "trainable": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last", "name": "zero_padding2d_1"}, "class_name": "ZeroPadding2D"}, {"config": {"data_format": "channels_last", "activation": "relu", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 64, "name": "conv2d_2", "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last", "name": "zero_padding2d_2"}, "class_name": "ZeroPadding2D"}, {"config": {"data_format": "channels_last", "activation": "relu", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 128, "name": "conv2d_3", "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last", "name": "zero_padding2d_3"}, "class_name": "ZeroPadding2D"}, {"config": {"data_format": "channels_last", "activation": "relu", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 128, "name": "conv2d_4", "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last", "name": "zero_padding2d_4"}, "class_name": "ZeroPadding2D"}, {"config": {"data_format": "channels_last", "activation": "relu", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 256, "name": "conv2d_5", "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last", "name": "zero_padding2d_5"}, "class_name": "ZeroPadding2D"}, {"config": {"data_format": "channels_last", "activation": "relu", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 256, "name": "conv2d_6", "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last", "name": "zero_padding2d_6"}, "class_name": "ZeroPadding2D"}, {"config": {"data_format": "channels_last", "activation": "relu", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 256, "name": "conv2d_7", "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last", "name": "zero_padding2d_7"}, "class_name": "ZeroPadding2D"}, {"config": {"data_format": "channels_last", "activation": "relu", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 512, "name": "conv2d_8", "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last", "name": "zero_padding2d_8"}, "class_name": "ZeroPadding2D"}, {"config": {"data_format": "channels_last", "activation": "relu", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 512, "name": "conv2d_9", "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last", "name": "zero_padding2d_9"}, "class_name": "ZeroPadding2D"}, {"config": {"data_format": "channels_last", "activation": "relu", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 512, "name": "conv2d_10", "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last", "name": "zero_padding2d_10"}, "class_name": "ZeroPadding2D"}, {"config": {"data_format": "channels_last", "activation": "relu", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 512, "name": "conv2d_11", "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last", "name": "zero_padding2d_11"}, "class_name": "ZeroPadding2D"}, {"config": {"data_format": "channels_last", "activation": "relu", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 512, "name": "conv2d_12", "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last", "name": "zero_padding2d_12"}, "class_name": "ZeroPadding2D"}, {"config": {"data_format": "channels_last", "activation": "relu", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 512, "name": "conv2d_13", "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_5"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"activation": "relu", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "units": 4096, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "rate": 0.5, "seed": null, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "units": 4096, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "rate": 0.5, "seed": null, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "units": 2, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential"}